In [2]:
%load_ext sql
%env DATABASE_URL = postgresql://marcio_gabriel:123456@localhost:5432/data_engineering

env: DATABASE_URL=postgresql://marcio_gabriel:123456@localhost:5432/data_engineering

# STRING MANIPULATION

In [3]:
%%sql
SELECT lower('HeLLo WoRld') AS lower_result, 
upper('HeLLo WoRld') AS upper_result, 
initcap('HeLLo WoRld') AS initcap_result

1 rows affected.

[('hello world', 'HELLO WORLD', 'Hello World')]

In [4]:
%%sql
SELECT length('HeLLo WoRld') AS length

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(11,)]

In [5]:
%%sql
SELECT order_id, order_date, order_customer_id,
    lower(order_status) AS order_status,
    length(order_status) AS order_status_length
FROM orders
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'closed', 6),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'pending_payment', 15),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'complete', 8),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'closed', 6),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'complete', 8),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'complete', 8),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'complete', 8),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'processing', 10),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'pending_payment', 15),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'pending_payment', 15)]

In [6]:
%%sql
SELECT order_id, 
    SUBSTR(order_date::varchar,1,7) AS order_date,
    order_customer_id,
    order_status
FROM orders
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, '2013-07', 11599, 'CLOSED'),
 (2, '2013-07', 256, 'PENDING_PAYMENT'),
 (3, '2013-07', 12111, 'COMPLETE'),
 (4, '2013-07', 8827, 'CLOSED'),
 (5, '2013-07', 11318, 'COMPLETE'),
 (6, '2013-07', 7130, 'COMPLETE'),
 (7, '2013-07', 4530, 'COMPLETE'),
 (8, '2013-07', 2911, 'PROCESSING'),
 (9, '2013-07', 5657, 'PENDING_PAYMENT'),
 (10, '2013-07', 5648, 'PENDING_PAYMENT')]

# Using Position and strpos

In [7]:
%%sql
SELECT position('@' IN 'it@versity.com'),
    position('@' IN 'itversity.com')

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(3, 0)]

In [8]:
%%sql
SELECT strpos('it@versity.com','@'),
    strpos('itversity.com', '@')

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(3, 0)]

In [9]:
%%sql

WITH email_ids AS (
    SELECT 'bsellan0@yellowbook.com' AS email_id UNION
    SELECT 'rstelljes1@illinois.edu' UNION
    SELECT 'mmalarkey2@webeden.co.uk' UNION
    SELECT 'emussared3@redcross.org' UNION
    SELECT 'livashin4@bloglovin.com' UNION
    SELECT 'gkeach5cbc.ca' UNION
    SELECT 'emasham6@xing.com' UNION
    SELECT 'rcobbald7@house.gov' UNION
    SELECT 'rdrohan8@washingtonpost.com' UNION
    SELECT 'aebben9@arstechnica.com'
) SELECT email_id, position('@' IN email_id),
    strpos(email_id, '@')
FROM email_ids
ORDER BY 2, 1

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[('gkeach5cbc.ca', 0, 0),
 ('aebben9@arstechnica.com', 8, 8),
 ('bsellan0@yellowbook.com', 9, 9),
 ('emasham6@xing.com', 9, 9),
 ('rdrohan8@washingtonpost.com', 9, 9),
 ('livashin4@bloglovin.com', 10, 10),
 ('rcobbald7@house.gov', 10, 10),
 ('emussared3@redcross.org', 11, 11),
 ('mmalarkey2@webeden.co.uk', 11, 11),
 ('rstelljes1@illinois.edu', 11, 11)]

In [10]:
%%sql

WITH email_ids AS (
    SELECT 'bsellan0@yellowbook.com' AS email_id UNION
    SELECT 'rstelljes1@illinois.edu' UNION
    SELECT 'mmalarkey2@webeden.co.uk' UNION
    SELECT 'emussared3@redcross.org' UNION
    SELECT 'livashin4@bloglovin.com' UNION
    SELECT 'gkeach5cbc.ca' UNION
    SELECT 'emasham6@xing.com' UNION
    SELECT 'rcobbald7@house.gov' UNION
    SELECT 'rdrohan8@washingtonpost.com' UNION
    SELECT 'aebben9@arstechnica.com'
) SELECT email_id, position('@' IN email_id),
    strpos(email_id, '@')
FROM email_ids
WHERE position ('@' IN email_id) = 0
ORDER BY 1

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('gkeach5cbc.ca', 0, 0)]

In [11]:
%%sql

WITH unique_ids AS (
    SELECT '241-80-7115' AS unique_id UNION
    SELECT '694-30-6851' UNION
    SELECT '586-92-5361' UNION
    SELECT '884-65-284' UNION
    SELECT '876-99-585' UNION
    SELECT '831-59-5593' UNION
    SELECT '399-88-3617' UNION
    SELECT '733-17-4217' UNION
    SELECT '873-68-9778' UNION
    SELECT '48'
) SELECT unique_id,
     position('-' IN unique_id) AS pos,
    position('-' IN unique_id) + position('-' IN substring(unique_id FROM 5)) AS pos_2nd
    
FROM unique_ids
ORDER BY unique_id

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[('241-80-7115', 4, 7),
 ('399-88-3617', 4, 7),
 ('48', 0, 0),
 ('586-92-5361', 4, 7),
 ('694-30-6851', 4, 7),
 ('733-17-4217', 4, 7),
 ('831-59-5593', 4, 7),
 ('873-68-9778', 4, 7),
 ('876-99-585', 4, 7),
 ('884-65-284', 4, 7)]

### Trimming and Padding Functions

In [12]:
%%sql

SELECT ltrim('     Hello World') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [13]:
%%sql

SELECT rtrim('     Hello World       ') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('     Hello World',)]

In [14]:
%%sql

SELECT length(trim('     Hello World       ')) AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(11,)]

In [15]:
%%sql

SELECT ltrim('----Hello World----', '-') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World----',)]

In [16]:
%%sql

SELECT rtrim('----Hello World----', '-') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('----Hello World',)]

In [17]:
%%sql

SELECT trim('----Hello World----', '-') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [19]:
%%sql

SELECT trim(TRAILING '-' FROM '----Hello World----') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('----Hello World',)]

In [20]:
%%sql

SELECT trim(BOTH '-' FROM '----Hello World----') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [21]:
%%sql

SELECT 2013 AS year, 7 AS month, 25 AS myDate

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(2013, 7, 25)]

In [22]:
%%sql

SELECT lpad(7::varchar, 2, '0') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('07',)]

In [26]:
%%sql

SELECT lpad(10::varchar, 2, '0') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('10',)]

In [24]:
%%sql

SELECT lpad(100::varchar, 2, '0') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('10',)]

### Reverse and Concatenating multiple strings

In [28]:
%%sql

SELECT reverse('Hello World') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('dlroW olleH',)]

In [29]:
%%sql

SELECT concat('Hello ', 'World') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [30]:
%%sql

SELECT concat('Order Status is ', order_status) AS result
FROM orders LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[('Order Status is CLOSED',),
 ('Order Status is PENDING_PAYMENT',),
 ('Order Status is COMPLETE',),
 ('Order Status is CLOSED',),
 ('Order Status is COMPLETE',),
 ('Order Status is COMPLETE',),
 ('Order Status is COMPLETE',),
 ('Order Status is PROCESSING',),
 ('Order Status is PENDING_PAYMENT',),
 ('Order Status is PENDING_PAYMENT',)]

In [31]:
%%sql

SELECT * FROM (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(2013, 7, 25)]

In [32]:
%%sql

SELECT concat(year, '-', lpad(month::varchar, 2, '0'), '-',
              lpad(myDate::varchar, 2, '0')) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('2013-07-25',)]

In [34]:
%%sql

SELECT concat_ws(
    '-', 
    year, 
    lpad(month::varchar, 2, '0'),
    lpad(myDate::varchar, 2, '0')
) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('2013-07-25',)]